tests/golden/detached_head_verbose.mermaid
flowchart RL
    HEAD["HEAD"]
    d985e3fe522b7bdefa3e2f92e61c8e711765b114["commit<br/>d985e"]
    2e81171448eb9f2ee3821e3d447aa6b2fe3ddba1["tree<br/>2e811"]
    ce013625030ba8dba906f756967f9e9ca394464a["blob<br/>ce013"]
    refs_heads_main["main"]
    2ffc39fe3f2ec3a1998a9715d9a456ed74e06b39["commit<br/>2ffc3"]
    18eb80fbbbf9160491c007668d5298f1e86cd40a["tree<br/>18eb8"]
    cc628ccd10742baea8241c5924df992b5c019f71["blob<br/>cc628"]
    HEAD --> d985e3fe522b7bdefa3e2f92e61c8e711765b114
    d985e3fe522b7bdefa3e2f92e61c8e711765b114 --> 2e81171448eb9f2ee3821e3d447aa6b2fe3ddba1
    2e81171448eb9f2ee3821e3d447aa6b2fe3ddba1 -->|"a.txt"| ce013625030ba8dba906f756967f9e9ca394464a
    refs_heads_main --> 2ffc39fe3f2ec3a1998a9715d9a456ed74e06b39
    2ffc39fe3f2ec3a1998a9715d9a456ed74e06b39 --> 18eb80fbbbf9160491c007668d5298f1e86cd40a
    18eb80fbbbf9160491c007668d5298f1e86cd40a -->|"a.txt"| ce013625030ba8dba906f756967f9e9ca394464a
    18eb80fbbbf9160491c007668d5298f1e86cd40a -->|"b.txt"| cc628ccd10742baea8241c5924df992b5c019f71
    2ffc39fe3f2ec3a1998a9715d9a456ed74e06b39 --> d985e3fe522b7bdefa3e2f92e61c8e711765b114
    style HEAD fill:#ffe5e5,stroke:#ff0000,stroke-width:2px
    style d985e3fe522b7bdefa3e2f92e61c8e711765b114 fill:#f6ffe5,stroke:#aaff00,stroke-width:2px
    style 2e81171448eb9f2ee3821e3d447aa6b2fe3ddba1 fill:#e5fff6,stroke:#00ffa9,stroke-width:2px
    style ce013625030ba8dba906f756967f9e9ca394464a fill:#e5f6ff,stroke:#00a9ff,stroke-width:2px
    style refs_heads_main fill:#ffe5e5,stroke:#ff0000,stroke-width:2px
    style 2ffc39fe3f2ec3a1998a9715d9a456ed74e06b39 fill:#f6ffe5,stroke:#aaff00,stroke-width:2px
    style 18eb80fbbbf9160491c007668d5298f1e86cd40a fill:#e5fff6,stroke:#00ffa9,stroke-width:2px
    style cc628ccd10742baea8241c5924df992b5c019f71 fill:#e5f6ff,stroke:#00a9ff,stroke-width:2px
